## Data Visualization

In [3]:
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
f500data= pd.read_csv("fortune500_data.csv")

In [5]:
f500data.head()

   Year  Rank           Company  Revenue Profit
0  1955     1    General Motors   9823.5    806
1  1955     2       Exxon Mobil   5661.4  584.8
2  1955     3        U.S. Steel   3250.4  195.4
3  1955     4  General Electric   2959.1  212.6
4  1955     5            Esmark   2510.8   19.1

In [6]:
f500data.describe()

              Year          Rank        Revenue
count  25500.00000  25500.000000   25500.000000
mean    1980.00000    250.499765    4273.329635
std       14.71989    144.339963   11351.884979
min     1955.00000      1.000000      49.700000
25%     1967.00000    125.750000     362.300000
50%     1980.00000    250.500000    1019.000000
75%     1993.00000    375.250000    3871.000000
max     2005.00000    500.000000  288189.000000

Question 1:
Generate a plot that details the 5 top Companies by Revenue for each Decade.
E.g., Top 5 for 1950-1959, 1960-1969, etc. This must be a single plot, either static or interactive.

To do this I must first identify the top 5 Companies by Revenue for each Decade. I create a new dataframe that
contains the top 5 companies in each year and put it in a new dataframe.

In [7]:
# Load your company data into a pandas dataframe
df = pd.read_csv("fortune500_data.csv")

# Convert the date column to a pandas datetime object
df['Year'] = pd.to_datetime(df['Year'])

# Group the data by company and decade and sum the revenue values
df_decade = df.groupby([df['Company'], df['Year'].dt.year // 10 * 10])['Revenue'].sum()

# Print the resulting dataframe
print(df_decade)

Company                       Year
3Com                          1970     20348.3
3M                            1970    359032.7
A-T-O                         1970      1302.7
A. Schulman                   1970      4541.5
A.H. Robins                   1970      4963.7
                                        ...
Youngstown Sheet & Tube       1970      9621.7
Yuba Consolidated Industries  1970       189.8
Yum Brands                    1970     55484.0
Zenith Electronics            1970     37618.0
Zurn Industries               1970       610.6
Name: Revenue, Length: 1887, dtype: float64

In [8]:


# Convert the date column to a pandas datetime object
df['Year'] = pd.to_datetime(df['Year'])

# Group the data by company and decade and sum the revenue values
df_decade = df.groupby([df['Company'], df['Year'].dt.year // 10 * 10]).agg({'Revenue': 'sum', 'Year': lambda x: str(x.dt.year // 10 * 10) + 's'})

# Print the resulting dataframe
print(df_decade)

                                    Revenue  \
Company                      Year
3Com                         1970   20348.3
3M                           1970  359032.7
A-T-O                        1970    1302.7
A. Schulman                  1970    4541.5
A.H. Robins                  1970    4963.7
...                                     ...
Youngstown Sheet & Tube      1970    9621.7
Yuba Consolidated Industries 1970     189.8
Yum Brands                   1970   55484.0
Zenith Electronics           1970   37618.0
Zurn Industries              1970     610.6

                                                                                Year
Company                      Year
3Com                         1970  19995    1970\n21954    1970\n22302    1970\n2...
3M                           1970  130      1970\n624      1970\n1115     1970\n1...
A-T-O                        1970  6820    1970\n7276    1970\n7757    1970\n8287...
A. Schulman                  1970  16997    1970\n17448    1970\n17950    1970\n1...
A.H. Robins                  1970  14461    1970\n14928    1970\n15403    1970\n1...
...                                                                              ...
Youngstown Sheet & Tube      1970  69      1970\n554     1970\n1052    1970\n1552...
Yuba Consolidated Industries 1970  3415    1970\n3911    1970\nName: Year, dtype:...
Yum Brands                   1970  22189    1970\n22725    1970\n23262    1970\n2...
Zenith Electronics           1970  223      1970\n724      1970\n1266     1970\n1...
Zurn Industries              1970           18463    1970\nName: Year, dtype: int64s

[1887 rows x 2 columns]